app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "this is joke ignore!!\r\nHAHAHA DID IT!!\r\n"], ["updated_at", "2020-06-06 23:29:04.936780"], ["id", 6]]
---
	def update
	  @post = Post.find(params[:id])
	  @post.update(title: params[:post][:title], description: params[:post][:description])